nxp-mcuxpresso/mcuxsdk-middleware-usb/example/boards/mcxn9xxevk_om13790host/usb_pd_alt_mode_dp_host/freertos/pin_mux.c
    gpio_pin_config_t ORIENT_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_10 (pin B12)  */
    GPIO_PinInit(BOARD_INITPINS_ORIENT_GPIO, BOARD_INITPINS_ORIENT_PIN, &ORIENT_config);

    gpio_pin_config_t nALERT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_28 (pin E8)  */
    GPIO_PinInit(BOARD_INITPINS_nALERT_GPIO, BOARD_INITPINS_nALERT_PIN, &nALERT_config);

    gpio_pin_config_t DP4LANE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_29 (pin F8)  */
    GPIO_PinInit(BOARD_INITPINS_DP4LANE_GPIO, BOARD_INITPINS_DP4LANE_PIN, &DP4LANE_config);

    gpio_pin_config_t EXTRA_EN_SRCn_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_30 (pin E7)  */
    GPIO_PinInit(BOARD_INITPINS_EXTRA_EN_SRCn_GPIO, BOARD_INITPINS_EXTRA_EN_SRCn_PIN, &EXTRA_EN_SRCn_config);

    gpio_pin_config_t DC_BARREL_PRES_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_2 (pin C4)  */
    GPIO_PinInit(BOARD_INITPINS_DC_BARREL_PRES_GPIO, BOARD_INITPINS_DC_BARREL_PRES_PIN, &DC_BARREL_PRES_config);

    gpio_pin_config_t P0_XSD_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_21 (pin L5)  */
    GPIO_PinInit(BOARD_INITPINS_P0_XSD_GPIO, BOARD_INITPINS_P0_XSD_PIN, &P0_XSD_config);

    gpio_pin_config_t DP_HPD_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_23 (pin M4)  */
    GPIO_PinInit(BOARD_INITPINS_DP_HPD_GPIO, BOARD_INITPINS_DP_HPD_PIN, &DP_HPD_config);

    const port_pin_config_t ORIENT = {/* Internal pull-up/down resistor is disabled */
                                      kPORT_PullDisable,
                                      /* Low internal pull resistor value is selected. */
                                      kPORT_LowPullResistor,
                                      /* Fast slew rate is configured */
                                      kPORT_FastSlewRate,
                                      /* Passive input filter is disabled */
                                      kPORT_PassiveFilterDisable,
                                      /* Open drain output is disabled */
                                      kPORT_OpenDrainDisable,
                                      /* Low drive strength is configured */
                                      kPORT_LowDriveStrength,
                                      /* Pin is configured as PIO0_10 */
                                      kPORT_MuxAlt0,
                                      /* Digital input enabled */
                                      kPORT_InputBufferEnable,
                                      /* Digital input is not inverted */
                                      kPORT_InputNormal,
                                      /* Pin Control Register fields [15:0] are not locked */
                                      kPORT_UnlockRegister};
    /* PORT0_10 (pin B12) is configured as PIO0_10 */
    PORT_SetPinConfig(BOARD_INITPINS_ORIENT_PORT, BOARD_INITPINS_ORIENT_PIN, &ORIENT);

    const port_pin_config_t nALERT = {/* Internal pull-up/down resistor is disabled */
                                      kPORT_PullDisable,
                                      /* Low internal pull resistor value is selected. */
                                      kPORT_LowPullResistor,
                                      /* Fast slew rate is configured */
                                      kPORT_FastSlewRate,
                                      /* Passive input filter is disabled */
                                      kPORT_PassiveFilterDisable,
                                      /* Open drain output is disabled */
                                      kPORT_OpenDrainDisable,
                                      /* Low drive strength is configured */
                                      kPORT_LowDriveStrength,
                                      /* Pin is configured as PIO0_28 */
                                      kPORT_MuxAlt0,
                                      /* Digital input enabled */
                                      kPORT_InputBufferEnable,
                                      /* Digital input is not inverted */
                                      kPORT_InputNormal,
                                      /* Pin Control Register fields [15:0] are not locked */
                                      kPORT_UnlockRegister};
    /* PORT0_28 (pin E8) is configured as PIO0_28 */
    PORT_SetPinConfig(BOARD_INITPINS_nALERT_PORT, BOARD_INITPINS_nALERT_PIN, &nALERT);

    const port_pin_config_t DP4LANE = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Low internal pull resistor value is selected. */
                                       kPORT_LowPullResistor,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Passive input filter is disabled */
                                       kPORT_PassiveFilterDisable,
                                       /* Open drain output is disabled */
                                       kPORT_OpenDrainDisable,
                                       /* Low drive strength is configured */
                                       kPORT_LowDriveStrength,
                                       /* Pin is configured as PIO0_29 */
                                       kPORT_MuxAlt0,
                                       /* Digital input enabled */
                                       kPORT_InputBufferEnable,
                                       /* Digital input is not inverted */
                                       kPORT_InputNormal,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORT0_29 (pin F8) is configured as PIO0_29 */
    PORT_SetPinConfig(BOARD_INITPINS_DP4LANE_PORT, BOARD_INITPINS_DP4LANE_PIN, &DP4LANE);

    const port_pin_config_t EXTRA_EN_SRCn = {/* Internal pull-up/down resistor is disabled */
                                             kPORT_PullDisable,
                                             /* Low internal pull resistor value is selected. */
                                             kPORT_LowPullResistor,
                                             /* Fast slew rate is configured */
                                             kPORT_FastSlewRate,
                                             /* Passive input filter is disabled */
                                             kPORT_PassiveFilterDisable,
                                             /* Open drain output is disabled */
                                             kPORT_OpenDrainDisable,
                                             /* Low drive strength is configured */
                                             kPORT_LowDriveStrength,
                                             /* Pin is configured as PIO0_30 */
                                             kPORT_MuxAlt0,
                                             /* Digital input enabled */
                                             kPORT_InputBufferEnable,
                                             /* Digital input is not inverted */
                                             kPORT_InputNormal,
                                             /* Pin Control Register fields [15:0] are not locked */
                                             kPORT_UnlockRegister};
    /* PORT0_30 (pin E7) is configured as PIO0_30 */
    PORT_SetPinConfig(BOARD_INITPINS_EXTRA_EN_SRCn_PORT, BOARD_INITPINS_EXTRA_EN_SRCn_PIN, &EXTRA_EN_SRCn);

    const port_pin_config_t DC_BARREL_PRES = {/* Internal pull-up/down resistor is disabled */
                                              kPORT_PullDisable,
                                              /* Low internal pull resistor value is selected. */
                                              kPORT_LowPullResistor,
                                              /* Fast slew rate is configured */
                                              kPORT_FastSlewRate,
                                              /* Passive input filter is disabled */
                                              kPORT_PassiveFilterDisable,
                                              /* Open drain output is disabled */
                                              kPORT_OpenDrainDisable,
                                              /* Low drive strength is configured */
                                              kPORT_LowDriveStrength,
                                              /* Pin is configured as PIO1_2 */
                                              kPORT_MuxAlt0,
                                              /* Digital input enabled */
                                              kPORT_InputBufferEnable,
                                              /* Digital input is not inverted */
                                              kPORT_InputNormal,
                                              /* Pin Control Register fields [15:0] are not locked */
                                              kPORT_UnlockRegister};
    /* PORT1_2 (pin C4) is configured as PIO1_2 */
    PORT_SetPinConfig(BOARD_INITPINS_DC_BARREL_PRES_PORT, BOARD_INITPINS_DC_BARREL_PRES_PIN, &DC_BARREL_PRES);

    const port_pin_config_t P0_XSD = {/* Internal pull-up/down resistor is disabled */
                                      kPORT_PullDisable,
                                      /* Low internal pull resistor value is selected. */
                                      kPORT_LowPullResistor,
                                      /* Fast slew rate is configured */
                                      kPORT_FastSlewRate,
                                      /* Passive input filter is disabled */
                                      kPORT_PassiveFilterDisable,
                                      /* Open drain output is disabled */
                                      kPORT_OpenDrainDisable,
                                      /* Low drive strength is configured */
                                      kPORT_LowDriveStrength,
                                      /* Pin is configured as PIO1_21 */
                                      kPORT_MuxAlt0,
                                      /* Digital input enabled */
                                      kPORT_InputBufferEnable,
                                      /* Digital input is not inverted */
                                      kPORT_InputNormal,
                                      /* Pin Control Register fields [15:0] are not locked */
                                      kPORT_UnlockRegister};
    /* PORT1_21 (pin L5) is configured as PIO1_21 */
    PORT_SetPinConfig(BOARD_INITPINS_P0_XSD_PORT, BOARD_INITPINS_P0_XSD_PIN, &P0_XSD);

    const port_pin_config_t DP_HPD = {/* Internal pull-up/down resistor is disabled */
                                      kPORT_PullDisable,
                                      /* Low internal pull resistor value is selected. */
                                      kPORT_LowPullResistor,
                                      /* Fast slew rate is configured */
                                      kPORT_FastSlewRate,
                                      /* Passive input filter is disabled */
                                      kPORT_PassiveFilterDisable,
                                      /* Open drain output is disabled */
                                      kPORT_OpenDrainDisable,
                                      /* Low drive strength is configured */
                                      kPORT_LowDriveStrength,
                                      /* Pin is configured as PIO1_23 */
                                      kPORT_MuxAlt0,
                                      /* Digital input enabled */
                                      kPORT_InputBufferEnable,
                                      /* Digital input is not inverted */
                                      kPORT_InputNormal,
                                      /* Pin Control Register fields [15:0] are not locked */
                                      kPORT_UnlockRegister};
    /* PORT1_23 (pin M4) is configured as PIO1_23 */
    PORT_SetPinConfig(BOARD_INITPINS_DP_HPD_PORT, BOARD_INITPINS_DP_HPD_PIN, &DP_HPD);

    const port_pin_config_t port1_8_pinA1_config = {/* Internal pull-up/down resistor is disabled */
                                                    kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    kPORT_LowDriveStrength,
                                                    /* Pin is configured as FC4_P0 */
                                                    kPORT_MuxAlt2,
                                                    /* Digital input enabled */
                                                    kPORT_InputBufferEnable,
                                                    /* Digital input is not inverted */
                                                    kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    kPORT_UnlockRegister};
    /* PORT1_8 (pin A1) is configured as FC4_P0 */
    PORT_SetPinConfig(PORT1, 8U, &port1_8_pinA1_config);

